-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 03, 2021 at 06:08 PM
-- Server version: 10.4.17-MariaDB
-- PHP Version: 8.0.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `STUDENTS`
--

-- --------------------------------------------------------

--
-- Table structure for table `sinhvien`
--

CREATE TABLE `sinhvien` (
  `id` int(11) NOT NULL,
  `maSV` int(11) NOT NULL,
  `hodemSV` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tenSV` varchar(30) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `ngaysinhSv` date NOT NULL,
  `tongtinchi` int(11) NOT NULL,
  `stctd` int(11) NOT NULL,
  `stcln` int(11) NOT NULL,
  `dtbc` float NOT NULL,
  `dtbcqd` float NOT NULL,
  `somonkhongdat` int(11) NOT NULL,
  `sotcdvht` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `sinhvien`
--

INSERT INTO `sinhvien` (`id`, `maSV`, `hodemSV`, `tenSV`, `ngaysinhSv`, `tongtinchi`, `stctd`, `stcln`, `dtbc`, `dtbcqd`, `somonkhongdat`, `sotcdvht`) VALUES
(1, 1851060037, 'Mai Việt', 'Anh', '2000-09-02', 27, 25, 22, 5.52, 1.72, 1, 3),
(2, 1851061860, 'Nguyễn Bảo', 'Anh', '2000-06-02', 21, 19, 19, 6.64, 2.21, 0, 0),
(3, 1851061542, 'Nguyễn Danh Tuấn', 'Anh', '2000-02-02', 0, 0, 0, 0, 0, 0, 0),
(4, 1851060136, 'Nguyễn Đức', 'Anh', '2000-12-02', 14, 13, 10, 4.19, 0.77, 1, 3),
(5, 1851061842, 'Trần Thị Kim', 'Anh', '2000-10-02', 20, 19, 16, 5.93, 1.68, 2, 4),
(6, 1851061426, 'Trần Tuấn', 'Anh', '2000-02-02', 20, 19, 10, 3.8, 0.68, 4, 10),
(7, 1851061528, 'Phan Nguyễn Nhật', 'Bảo', '2000-09-02', 21, 19, 19, 8.63, 3.68, 0, 0),
(8, 1851061827, 'Trần Thị Ngọc', 'Bích', '1999-08-01', 20, 19, 19, 8.55, 3.68, 0, 0),
(9, 1851061725, 'Đoàn Khánh', 'Chi', '2000-02-02', 21, 19, 19, 8.25, 3.32, 1, 1),
(10, 1851061805, 'Lê Hoàng Bảo', 'Chung', '2000-08-02', 24, 22, 22, 7.4, 3, 2, 2),
(11, 1851061341, 'Nguyễn Thị', 'Dung', '2000-05-02', 18, 16, 16, 7.19, 2.63, 0, 0),
(12, 1851061523, 'Nguyễn Hồng', 'Duyên', '2000-07-02', 20, 19, 19, 6.89, 2.32, 0, 0),
(13, 1851061935, 'Đào Minh', 'Dương', '2000-06-02', 24, 22, 13, 4.25, 0.73, 3, 9),
(14, 1851061456, 'Lê Nhật', 'Dương', '2000-07-02', 15, 13, 0, 3, 0, 5, 14),
(15, 1851061370, 'Nguyễn Thái', 'Dương', '2000-11-02', 21, 19, 19, 5.99, 1.95, 0, 0),
(16, 1851061463, 'Nguyễn Văn', 'Dương', '2000-10-02', 14, 13, 6, 3.65, 1.38, 3, 8),
(17, 1851061526, 'Nguyễn Thành', 'Đạt', '2000-04-02', 21, 19, 15, 6.52, 2.05, 1, 4),
(18, 1851061904, 'Tống Xuân', 'Đạt', '2000-04-02', 21, 19, 19, 8.21, 3.16, 0, 0),
(19, 1851062039, 'Lê Văn', 'Độ', '2000-07-02', 21, 19, 19, 6.51, 2.16, 0, 0),
(20, 1851061590, 'Trần Văn', 'Đông', '2000-08-02', 26, 22, 19, 4.87, 1.14, 3, 5),
(21, 1851061585, 'Đoàn Thị', 'Hạnh', '2000-11-02', 21, 19, 19, 7.16, 2.68, 0, 0),
(22, 1851061955, 'Trần Xuân', 'Hiệp', '2000-12-02', 24, 22, 19, 5.18, 1.59, 2, 4),
(23, 1851061359, 'Bùi Xuân', 'Hiếu', '2000-10-02', 19, 19, 9, 4.06, 0.79, 3, 10),
(24, 1851061734, 'Nguyễn Trọng', 'Hiếu', '2000-11-02', 21, 19, 19, 7.29, 2.79, 0, 0),
(25, 1851061599, 'Nguyễn Trung', 'Hiếu', '2000-10-02', 24, 22, 13, 4.74, 1.14, 3, 9),
(26, 1851061603, 'Tho Văn', 'Hiệu', '2000-05-02', 24, 22, 19, 5.79, 2.09, 1, 3),
(27, 1851060051, 'Nguyễn Văn', 'Hoàng', '2000-06-02', 18, 16, 9, 4.5, 0.56, 3, 8),
(28, 1851061726, 'Nguyễn Văn', 'Hoàng', '2000-12-02', 21, 19, 19, 8.05, 3.47, 0, 0),
(29, 1851061326, 'Vũ Quang', 'Huy', '2000-06-02', 20, 19, 19, 5.13, 1.32, 0, 0),
(30, 1851061503, 'Lăng Thị Diệu', 'Linh', '2000-03-02', 20, 19, 16, 4.92, 1.16, 1, 3),
(31, 1851061431, 'Phạm Thị Thùy', 'Linh', '2000-11-02', 22, 21, 21, 7.26, 2.81, 0, 0),
(32, 1851060078, 'Đào Hoàng', 'Long', '2000-08-02', 19, 19, 19, 7.28, 2.84, 0, 0),
(33, 1851061399, 'Hoàng Hải', 'Long', '2000-03-02', 21, 19, 16, 5.72, 1.68, 2, 4),
(34, 1851061602, 'Nguyễn Mạnh', 'Long', '2000-08-02', 21, 19, 13, 5.59, 1.53, 2, 6),
(35, 1851061791, 'Nguyễn Thành', 'Long', '2000-09-02', 21, 19, 16, 5.78, 1.63, 1, 3),
(36, 1851061383, 'Trần Huy', 'Long', '2000-12-02', 20, 19, 0, 1.15, 0, 7, 20),
(37, 1851061697, 'Vũ Ngọc', 'Long', '2000-12-02', 10, 10, 6, 4.77, 1.2, 1, 4),
(38, 1851061627, 'Phí Đình', 'Lương', '2000-03-02', 20, 19, 13, 5.2, 1.68, 2, 6),
(39, 1851061753, 'Hoàng Thị', 'Mai', '2000-04-02', 20, 19, 16, 6.53, 2.05, 2, 4),
(40, 1851061758, 'Nguyễn Đình Đức', 'Mạnh', '2000-10-02', 13, 13, 0, 0.74, 0, 4, 13),
(41, 1851061761, 'Nguyễn Văn', 'Mạnh', '2000-11-02', 20, 19, 19, 7.61, 2.84, 0, 0),
(42, 1851061508, 'Vũ Quốc', 'Mạnh', '2000-04-02', 11, 9, 0, 0, 0, 4, 10),
(43, 1851061899, 'Phạm Quang', 'Minh', '2000-07-02', 20, 19, 13, 4.08, 1.21, 3, 7),
(44, 1851060012, 'Nguyễn Trọng', 'Nam', '2000-07-02', 23, 22, 19, 6.59, 2.18, 1, 3),
(45, 1851060681, 'Nguyễn Xuân', 'Nam', '2000-05-02', 20, 17, 11, 5.29, 1.47, 3, 7),
(46, 1851061701, 'Lê Văn', 'Ngận', '2000-04-02', 24, 22, 3, 2.24, 0.14, 7, 20),
(47, 1851061504, 'Nguyễn Văn', 'Nhật', '2000-04-02', 20, 19, 19, 7.62, 3, 0, 0),
(48, 1851061519, 'Nguyễn Viết', 'Phong', '2000-01-02', 20, 19, 19, 7.22, 2.53, 1, 1),
(49, 1851061934, 'Nguyễn Vũ', 'Phong', '1999-09-01', 21, 19, 16, 4.45, 1, 1, 3),
(50, 1851060522, 'Cao Thị Bích', 'Phương', '2000-03-02', 20, 19, 16, 6.51, 2.16, 2, 4),
(51, 1851061367, 'Đặng Thanh', 'Phương', '2000-09-02', 23, 22, 22, 6.75, 2.64, 0, 0),
(52, 1851061427, 'Trương Minh', 'Quang', '2000-10-02', 21, 19, 12, 5.33, 1.89, 3, 8),
(53, 1851061624, 'Vũ Ngọc', 'Sơn', '2000-03-02', 15, 13, 10, 4.33, 1.23, 1, 3),
(54, 1851060083, 'Đặng Minh', 'Tâm', '2000-02-02', 21, 19, 19, 8.06, 3.16, 0, 0),
(55, 1851061739, 'Phạm Huy', 'Thành', '2000-08-02', 20, 19, 19, 7.8, 3, 0, 0),
(56, 1851060024, 'Cấn Thị Thu', 'Thảo', '2000-01-02', 21, 19, 19, 7.26, 2.68, 0, 0),
(57, 1851061615, 'Trần Việt', 'Thắng', '2000-07-02', 25, 23, 23, 5.4, 1.3, 0, 0),
(58, 1851061743, 'Nguyễn Cao', 'Thiêm', '2000-02-02', 20, 19, 19, 8.62, 3.68, 0, 0),
(59, 1851061543, 'Hồ Chí', 'Thiện', '2000-04-02', 20, 19, 19, 6.82, 2.47, 0, 0),
(60, 1851060590, 'Lê Thị', 'Thơ', '1999-06-01', 21, 19, 19, 8.46, 3.47, 0, 0),
(61, 1851061483, 'Nguyễn Ngọc', 'Thư', '2000-07-02', 17, 16, 6, 3.87, 0.75, 4, 11),
(62, 1851061772, 'Nguyễn Văn', 'Tiến', '2000-10-02', 25, 23, 16, 4.97, 1.35, 3, 8),
(63, 1851061923, 'Lại Xuân', 'Trình', '2000-11-02', 14, 13, 3, 1.78, 0.23, 4, 11),
(64, 1851061717, 'Nguyễn Ngọc', 'Trung', '2000-05-02', 24, 22, 19, 6.18, 1.86, 1, 3),
(65, 1851061678, 'Nguyễn Văn', 'Trưởng', '2000-07-02', 21, 19, 19, 7.19, 2.68, 0, 0),
(66, 1851061687, 'Đặng Tiến', 'Tuấn', '2000-08-02', 24, 22, 22, 6.48, 2.32, 0, 0),
(67, 1851061716, 'Nguyễn Văn', 'Tuấn', '1999-10-01', 24, 24, 18, 5.67, 1.92, 2, 6),
(68, 1851061499, 'Nguyễn Danh', 'Tùng', '2000-11-02', 21, 19, 16, 5.39, 1.84, 3, 5),
(69, 1851063190, 'Nguyễn Thanh', 'Tùng', '2000-02-02', 22, 22, 16, 5.2, 1.55, 2, 6),
(70, 1851061638, 'Nguyễn Thị', 'Vân', '2000-01-02', 21, 19, 19, 7.49, 2.84, 0, 0),
(71, 1851061396, 'Nguyễn Thế', 'Việt', '2000-10-02', 21, 19, 19, 7.69, 2.84, 1, 1),
(72, 1851061679, 'Phí Hoàng', 'Yến', '2000-10-02', 21, 19, 19, 7.07, 2.53, 0, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sinhvien`
--
ALTER TABLE `sinhvien`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sinhvien`
--
ALTER TABLE `sinhvien`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
